x1 = int(input("введите первую координату первой клетки (от 1 до 8) - "))
y1 = int(input("введите вторую координату первой клетки (от 1 до 8) - "))
x2 = int(input("введите первую координату второй клетки (от 1 до 8) - "))
y2 = int(input("введите вторую координату второй клетки (от 1 до 8) - "))
if (8 >= x1 >= 1)&(8 >= y1 >= 1)&(8 >= x2 >= 1)&(8 >= y2 >= 1):
    if x1 == x2:
        ans = "YES"
    elif y1 == y2:
        ans = "YES"
    else:
        ans = "NO"
else:
    ans = "undefined"
print(ans)
input()
