print("Здравствуйте!")#Выводим приветствие
print("Данная программа предназначена для вычисления  площади прямоугольного\nтреугольника")#Выводим задачу программы
first_cath = float(input("Введите значение первого катета:"))#Команда для ввода переменной
second_cath = float(input("Введите значение второго катета:"))#Команда для ввода переменной
square = 0.5*second_cath*first_cath#подсчёт результата
print("Площадь равна " + str(square))#вывод результата
print(input("Нажмите клавишу \"Enter\"для окончания работы программы"))#Команда для окончания программы
