'''
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
'''
g1 = int(input("Кількість учнів у першій групі - "))
g2 = int(input("Кількість учнів у другій групі - "))
g3 = int(input("Кількість учнів у третій групі - "))
dg1 = g1//2 + g1%2
dg2 = g2//2 + g2%2
dg3 = g3//2 + g3%2
if g1>0 and g2>0 and g3>0:
    print ("Мінімальна кількість столів", "-",dg1+dg2+dg3)
else:
    print ("Помилка")
