'''
Умова: N студентів отримали K яблук і розподілити їх між собою порівну. Неподілені яблука залишились у кошику. Скільки яблук отримає кожен студент? Скільки яблук залишиться в кошику?

Програма отримує числа N і K. Вона повинна вивести два числа: відповіді на поставлені вище питання.

Вхідні дані: 2 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести два числа. Перше - кількість яблук у студента, друге - кількість яблук, що лишилось у кошику.
'''
N = int(input("На скільки студентів треба розділити яблука?"))
K = int(input("Скільки яблук треба розділити?"))
P = K//N
C = K%N
if K>0 and N>0:
    print ("Кількість яблук у студента - ", P,"Кількість яблук у кошику - ", C)
else:
    print ("Помилка")
