'''
Умова: Шаховий слон рухається по діагоналі на будь-яку кількість клітин.
Дано координати двох клітин шахової дошки. Визначити, чи може слон перейти з
першої клітини у другу за один хід. Користувач вводить чотири цілих числа
від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини.
Перші два числа - для першої клітини, останні два числа – для другої.
Програма має вивести "YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
'''
a = int(input("Введіть номер рядку, де розташуваний слон - "))
b = int(input("Введіть номер стовпчика, де розташуваний слон - "))
c = int(input("Введіть номер рядку,куди слон повинен перейти - "))
d = int(input("Введіть номер стовпчика,куди слон повинен перейти - "))
if (a<1 or a>8) or (b<1 or b>8) or (c<1 or c>8) or (d<1 or d>8):
    answer = "NO"
elif abs(a-c)==abs(b-d):
    answer = "YES"
else:
    answer = "NO"
print (answer)
