'''
Умова: Дано три цілих числа. Визначте, скільки з них дорівнюють один одному. Програма повинна виводити одне з чисел: 3 (якщо всі числа однакові), 2 (якщо два з них дорівнюють один одному, а третє відрізняється) або 0 (якщо всі числа різні).

Вхідні дані: 3 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести ціле число

'''
a = int(input("Введіть перше число - "))
b = int(input("Введіть друге число - "))
c = int(input("Введіть третє число - "))
if a==b==c:
    answer = 3
elif a==b!=c or a==c!=b or b==c!=a:
    answer = 2
else:
    answer = 0
print(answer)
