'''
Умова: Шахова тура переміщається по горизонталі або по вертикалі. Дано координати двох клітин шахової дошки. Визначити, чи може тура перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести "YES", якщо тура може виконати переміщення, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
'''
a = int(input("Введіть номер рядку, де розташувана фігура - "))
b = int(input("Введіть номер стовпчика, де розташувана фігура - "))
c = int(input("Введіть номер рядку,куди необхідно перейти - "))
d = int(input("Введіть номер стовпчика,куди необхідно перейти - "))
if (a<1 or a>8) or (b<1 or b>8) or (c<1 or c>8) or (d<1 or d>8):
    answer = "NO"
elif a==c or b==d:
    answer = "YES"
else:
    answer = "NO"
print (answer)
