'''
Умова: Шоколад має форму прямокутника, розділеного на n×m клітин. Шоколад може бути розділений на дві частини тільки по горизонталі або по вертикалі, при цьому клітини мають бути цілими. Визначити, чи можна розділити шоколад за один крок таким чином, щоб одна з частин матиме точно k клітин. Програма має вивести "YES", якщо шоколад можна поділити, або "NO" в іншому випадку.

Вхідні дані: 3 цілих числа: n,m, k. Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
'''
n = int(input("Кількість рядочків в шоколаді - "))
m = int(input("Кількість стовпчиків в шоколаді - "))
k = int(input("Кількість клітинок після поділу - "))
if k>= m*n:
    answer = "NO"
elif k< m*n and (k%m==0 or k%n==0):
    answer = "Yes"
else:
    answer = "NO"
print (answer)
