'''
Умова: Шаховий кінь рухається як літера L. Він може переміщатись на дві клітинки по горизонталі і одну клітинку по вертикалі або на дві клітинки по вертикалі і одну
по горизонталі. Дано координати двох клітин шахової дошки. Визначити, чи може кінь перейти з першої клітини у другу за один хід. Користувач вводить чотири цілих
числа від 1 до 8, кожне з яких визначає номер рядку та стовпчика клітини. Перші два числа - для першої клітини, останні два числа – для другої. Програма має вивести
"YES", якщо хід можливий, або "NO" в іншому випадку.

Вхідні дані: 4 цілих числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести текстовий рядок.
'''
a = int(input("Введіть номер рядку, де розташуваний кінь - "))
b = int(input("Введіть номер стовпчика, де розташуваний кінь - "))
c = int(input("Введіть номер рядку, куди кінь повинен перейти, - "))
d = int(input("Введіть номер стовпчика,куди кінь повинен перейти - "))
if (a<1 or a>8) or (b<1 or b>8) or (c<1 or c>8) or (d<1 or d>8):
    answer = "NO"
elif (abs(a-c)==1 and abs(b-d)==2) or (abs(a-c)==2 and abs(b-d)==1):
    answer = "YES"
else:
    answer = "NO"
print (answer)
