'''
Петя перейшов в іншу школу. На уроці фізкультури йому знадобилося визначити своє місце в строю. Допоможіть йому це зробити.

Програма отримує на вхід незростаючу послідовність натуральних чисел, що означають зріст кожної людини в строю. Після цього вводиться число X - зріст Петі. Усі числа у вхідних даних натуральні і не перевищують 200. 

Виведіть номер, під яким Петя повинен стати до строю. Якщо в строю є люди з однаковим зростом, таким же, як у Петі, то він повинен встати після них.
'''
H = [int(i) for i in input("Введіть зріст інших учнів - ").split()]
h = int(input("Введіть зріст Петі - "))
x = 0
if h<=200 and h>0:
    if H<=[200] and H>[0]:
        while len(H)>x and h <= H[x]:
            x = x + 1
            print(x + 1)
    else:
        print("Помилка")
